#此文件包含四个字典，省市简称字典，银行简称字典，监管机构简称字典和地方监管机构字典
#字典一：省市简称字典
province_city_abb_dictionary = {"中国":"中","北京":"京","北京市":"京","深圳": "深","深圳市": "深","上海":"沪","上海市":"沪","浙江":"浙","浙江省":"浙","天津":"津","天津市":"津","安徽":"皖",
"安徽省": "皖","福建": "闽","福建省": "闽","重庆": "渝","重庆市": "渝","江西": "赣","江西省": "赣","江苏省":"苏","江苏":"苏","山东": "鲁","山东省": "鲁","河南": "豫","河南省": "豫","湖北": "鄂",
"湖北省": "鄂","湖南": "湘","湖南省": "湘","广东": "粤","广东省": "粤","海南": "琼","海南省": "琼","河北": "冀","河北省": "冀","郑州": "郑",
# 以下五个省的简称有两个
"四川": "川","四川省": "川","贵州": "黔","贵州省": "黔","云南": "云","云南省": "云","陕西": "陕","陕西省": "陕","甘肃": "甘","甘肃省": "甘",
"山西": "晋","山西省": "晋","辽宁": "辽","辽宁省": "辽","吉林": "吉","吉林省": "吉","黑龙江": "黑","黑龙江省": "黑","青海": "青","青海省": "青","内蒙古": "蒙","新疆": "新","宁夏": "宁",
"广西": "桂","西藏": "藏"
}

#字典二：银行简称字典
bank_full_abb_dictionary = {
    "中国人民银行":"央行",
    "中国工商银行":"工行",
    "中国银行":"中行",
    "中国建设银行":"建行",
    "中国农业银行":"农行",
    "交通银行":"交行",
    "招商银行":"招行",
    "上海浦东发展银行":"浦发银行",
}

#字典三：监管机构简称字典
regulator_dictionary ={
    "中国证券监督管理委员会":"证监会",
    "中国保险监督管理委员会":"保监会",
    "中国银行业监督管理委员会":"银监会",
    "中国银行保险监督管理委员会":"银保监会"
}

#字典四：地方监管机构简称字典
place_regulator_dictionary ={
    "中国证券监督管理委员会":"证监局",
    "中国保险监督管理委员会":"保监局",
    "中国银行业监督管理委员会":"银监局",
    "中国银行保险监督管理委员会": "银保监局"
}